Catalogs/НастройкиПодключенияКAPI.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>НастройкиПодключенияКAPI</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДопСвойства</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДопСвойство</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/НастройкиПодключенияКAPI/Ext/ManagerModule.bsl
Функция ПолучитьСтруктуруПодключенияAPI(НаименованиеAPI) Экспорт
	
	СтруктураПараметров = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиПодключенияКAPI.Наименование,
		|	НастройкиПодключенияКAPI.Логин,
		|	НастройкиПодключенияКAPI.Пароль,
		|	НастройкиПодключенияКAPI.Адрес,
		|	НастройкиПодключенияКAPI.Ссылка
		|ИЗ
		|	Справочник.НастройкиПодключенияКAPI КАК НастройкиПодключенияКAPI
		|ГДЕ
		|	НЕ НастройкиПодключенияКAPI.ПометкаУдаления
		|	И НастройкиПодключенияКAPI.Наименование = &НаименованиеAPI";
	
	Запрос.УстановитьПараметр("НаименованиеAPI", НаименованиеAPI);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи 	= РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СтруктураПараметров.Вставить("Наименование", ВыборкаДетальныеЗаписи.Наименование);
		СтруктураПараметров.Вставить("Логин", ВыборкаДетальныеЗаписи.Логин);
		СтруктураПараметров.Вставить("Пароль", ВыборкаДетальныеЗаписи.Пароль);
		СтруктураПараметров.Вставить("Адрес", ВыборкаДетальныеЗаписи.Адрес);
		
	КонецЦикла;
	
	СтруктураПараметров.Вставить("ДопСвойства", ВыборкаДетальныеЗаписи.Ссылка.ДопСвойства.Выгрузить());
	
	Возврат СтруктураПараметров;
	
КонецФункции
